In [2]:
import pandas as pd

In [7]:
##create data frame
data = {'Company':['GOOGLE','GOOGLE','Microsoft','Microsoft','FaceBook','FaceBook','Amazon','Amazon'],        
       'Person':['Ram','Sam','Harry','John','Nirmal','Shane','Broad','Messi'],
       'Sales':[200,120,340,124,243,350,310,290]}

In [8]:
data

{'Company': ['GOOGLE',
  'GOOGLE',
  'Microsoft',
  'Microsoft',
  'FaceBook',
  'FaceBook',
  'Amazon',
  'Amazon'],
 'Person': ['Ram',
  'Sam',
  'Harry',
  'John',
  'Nirmal',
  'Shane',
  'Broad',
  'Messi'],
 'Sales': [200, 120, 340, 124, 243, 350, 310, 290]}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

     Company  Person  Sales
0     GOOGLE     Ram    200
1     GOOGLE     Sam    120
2  Microsoft   Harry    340
3  Microsoft    John    124
4   FaceBook  Nirmal    243
5   FaceBook   Shane    350
6     Amazon   Broad    310
7     Amazon   Messi    290

In [11]:
df.groupby('Company')

In [12]:
temp = df.groupby("Company")

In [13]:
temp.mean()

           Sales
Company
Amazon     300.0
FaceBook   296.5
GOOGLE     160.0
Microsoft  232.0

In [14]:
df.groupby('Company').mean()

           Sales
Company
Amazon     300.0
FaceBook   296.5
GOOGLE     160.0
Microsoft  232.0

In [15]:
temp.std()

                Sales
Company
Amazon      14.142136
FaceBook    75.660426
GOOGLE      56.568542
Microsoft  152.735065

In [16]:
temp.max()

          Person  Sales
Company
Amazon     Messi    310
FaceBook   Shane    350
GOOGLE       Sam    200
Microsoft   John    340

In [17]:
temp.min()

           Person  Sales
Company
Amazon      Broad    290
FaceBook   Nirmal    243
GOOGLE        Ram    120
Microsoft   Harry    124

In [18]:
temp.count()

           Person  Sales
Company
Amazon          2      2
FaceBook        2      2
GOOGLE          2      2
Microsoft       2      2

In [19]:
temp.describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
Amazon      2.0  300.0   14.142136  290.0  295.00  300.0  305.00  310.0
FaceBook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [20]:
temp.describe().transpose()

Company          Amazon    FaceBook      GOOGLE   Microsoft
Sales count    2.000000    2.000000    2.000000    2.000000
      mean   300.000000  296.500000  160.000000  232.000000
      std     14.142136   75.660426   56.568542  152.735065
      min    290.000000  243.000000  120.000000  124.000000
      25%    295.000000  269.750000  140.000000  178.000000
      50%    300.000000  296.500000  160.000000  232.000000
      75%    305.000000  323.250000  180.000000  286.000000
      max    310.000000  350.000000  200.000000  340.000000

In [21]:
temp.describe().transpose()['GOOGLE']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOGLE, dtype: float64

In [26]:
temp.Sales.describe()

           count   mean         std    min     25%    50%     75%    max
Company
Amazon       2.0  300.0   14.142136  290.0  295.00  300.0  305.00  310.0
FaceBook     2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft    2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [27]:
temp.describe().transpose()['Amazon']

Sales  count      2.000000
       mean     300.000000
       std       14.142136
       min      290.000000
       25%      295.000000
       50%      300.000000
       75%      305.000000
       max      310.000000
Name: Amazon, dtype: float64